arr=[7,8,6,1,5,9,4,3,0,2,10] 		# оголошуЇмо масив
n = arr.count - 1			# визначаЇмо к≥льк≥сть елемент≥в
l = n/2					# визначаЇмо першу в≥дстань м≥ж елементами
while l >= 1				# поки в≥дстань м≥ж елементами не зменшитьс€ до 1
n.downto(0) do |i|
 0.upto(i-l) do |j|
   arr[j], arr[j+l] = arr[j+l], arr[j] if arr[j] > arr[j+l] 	# м≥н€Їмо м≥сц€ми елементи, €кщо перший б≥льше другого
 end
end
l = l/2					# зменшуЇмо в дв≥ч≥ в≥дстань м≥ж елементами
end
puts arr				# виводимо в≥дсортований масив на екран

